taurus/taurus-demo.yml
settings:
    artifacts-dir: taurus-artifacts/%H%M%S
    env:
        JMETER_VERSION: "5.1.1"

execution:
- scenario: existing
#  concurrency: 50
  hold-for: 2m
  ramp-up: 30s

scenarios:
  existing:
    script: src/test/jmeter/mvn-demo.jmx

modules:
  jmeter:
    version: ${JMETER_VERSION}
    force-ctg: false
    memory-xmx: 2g
    detect-plugins: false
    properties:
      # Report configuration
      jmeter.reportgenerator.report_title: Report for leroymerlin.fr
      #jmeter.reportgenerator.exporter.html.series_filter: ^(vad-tunnelEtapeContinuer|lad-tunnelEtapeContinuer|AccesFP|AchatDrive|AchatLAD|HP|accesFP|ajoutPanier|c00-contextualisation|c01-clickChangerMagasin|c02-rechercherMagasin|c03-changerMagasin|cnx01-clickMonCompte|cnx02-meConnecter|cnx03-suiviCommande|cnx04-carteMaison|cnx05-listeCourse|d02-autoComplete|d03-clickLienAutoComplete|d04-clickSearch|d05-descenteProduit|d051-clickUnivers|d052-clickSousUnivers|d053-clickFamille|d06-descenteProduitLayer|d061-clickFamilleParLayer|ic00-clickIdeesConseils|ic01-scrollIdeesConseils|lad01-passerCommande|lad02-choisirLAD|lad04-continuerMaCommande|lad05-continuerApresInfosClient|lad06-reglerCommande|lc00-ListeCourse|lc01-ajouterListeCourse|lc02-validerListeCourse|lc03-voirListeCourse|remplirVille|s00-ClickServices|seo01-rebondProduit|seo02-clickFamille|vad01-passerCommande|vad02-choisirRetraitMag-CP|vad03-choisirMagasin|vad05-continuerMaCommande|vad06-continuerApresInfosClient|vad07-reglerCommande|voirPanier)(-success|-failure)?$
      jmeter.reportgenerator.overall_granularity: 60000
      jmeter.reportgenerator.apdex_satisfied_threshold: 2000
      jmeter.reportgenerator.apdex_tolerated_threshold: 8000
            
      # Validation:
      #timer.factor: 0.01f
      
      resdir: ./
      
      # Repartition VUs
      threads: 10
      output: ${TAURUS_ARTIFACTS_DIR}/

  modules:
    console:
      # disable console reporter
      disable: true  # default: auto

#  cloud:
#    test: https://a.blazemeter.com/app/#/accounts/172579/workspaces/166203/projects/297064/tests/6543068
services:
- module: shellexec
  run-at: local
  post-process:
  - ~/.bzt/jmeter-taurus/${JMETER_VERSION}/bin/jmeter -p ~/.bzt/jmeter-taurus/${JMETER_VERSION}/bin/jmeter.properties -q ${TAURUS_ARTIFACTS_DIR}/jmeter-bzt.properties -Jjmeter.save.saveservice.assertion_results_failure_message=false -g ${TAURUS_ARTIFACTS_DIR}/kpi.jtl -j ${TAURUS_ARTIFACTS_DIR}/jmeter-report.log -o ${TAURUS_ARTIFACTS_DIR}/report