taurus/taurus-demo.yml
settings:
    artifacts-dir: taurus-artifacts/%H%M%S
    env:
        JMETER_VERSION: "5.1.1"

execution:
- scenario: existing
#  concurrency: 50
  hold-for: 2m
  ramp-up: 30s

scenarios:
  existing:
    script: mvn-demo.jmx

modules:
  jmeter:
    version: ${JMETER_VERSION}
    force-ctg: false
    memory-xmx: 2g
    detect-plugins: false
    properties:
      # Report configuration
      jmeter.reportgenerator.report_title: Report 
      jmeter.reportgenerator.exporter.html.series_filter: ^(Scenario|Search|HP)(-success|-failure)?$
      jmeter.reportgenerator.overall_granularity: 60000
      jmeter.reportgenerator.apdex_satisfied_threshold: 2000
      jmeter.reportgenerator.apdex_tolerated_threshold: 8000
            
      # Validation:
      #timer.factor: 0.01f
      
      resdir: ./
      
      # Repartition VUs
      threads: 10
      output: ${TAURUS_ARTIFACTS_DIR}/

  modules:
    console:
      # disable console reporter
      disable: true  # default: auto

services:
- module: shellexec
  run-at: local
  post-process:
  - ~/.bzt/jmeter-taurus/${JMETER_VERSION}/bin/jmeter -p ~/.bzt/jmeter-taurus/${JMETER_VERSION}/bin/jmeter.properties -q ${TAURUS_ARTIFACTS_DIR}/jmeter-bzt.properties -g ${TAURUS_ARTIFACTS_DIR}/kpi.jtl -j ${TAURUS_ARTIFACTS_DIR}/jmeter-report.log -o ${TAURUS_ARTIFACTS_DIR}/report